Repository: Fadwahigga/GiveHope
Catalog: lib/src/l10n/app_*.arb
Languages: ar

# appName
source: GiveHope
ar: أعطِ أملاً

# appTagline
source: Making a difference, one donation at a time
ar: نصنع الفرق، تبرعاً تلو الآخر

# navHome
source: Home
ar: الرئيسية

# navExplore
source: Explore
ar: استكشف

# navHistory
source: History
ar: السجل

# navSettings
source: Settings
ar: الإعدادات

# homeTitle
source: Discover Causes
ar: اكتشف القضايا

# homeSubtitle
source: Support causes that matter to you
ar: ادعم القضايا التي تهمك

# homeSearchPlaceholder
source: Search causes...
ar: ابحث عن قضايا...

# homeFeatured
source: Featured
ar: المميزة

# homeAllCauses
source: All Causes
ar: جميع القضايا

# homeCategories
source: Categories
ar: التصنيفات

# homeNoCauses
source: No causes found
ar: لا توجد قضايا

# homeNoCausesDesc
source: There are no active causes at the moment. Check back later!
ar: لا توجد قضايا نشطة حالياً. تحقق لاحقاً!

# homeNoCausesYet
source: No causes yet
ar: لا توجد قضايا بعد

# homeNoCausesYetDesc
source: Be the first to create a cause!
ar: كن أول من ينشئ قضية!

# homeCreateCause
source: Create Cause
ar: إنشاء قضية

# homeRefresh
source: Refresh
ar: تحديث

# homeLoading
source: Loading causes...
ar: جارٍ تحميل القضايا...

# bannerTitle1
source: Make a Difference
ar: اصنع الفرق

# bannerDesc1
source: Support causes that matter to you with secure MTN MoMo payments
ar: ادعم القضايا التي تهمك عبر مدفوعات MTN MoMo الآمنة

# bannerTitle2
source: Easy & Fast
ar: سهل وسريع

# bannerDesc2
source: Donate in seconds with just a few taps. No hassle, no complications
ar: تبرع في ثوانٍ بضغطة واحدة. بدون تعقيدات

# bannerTitle3
source: Transparent
ar: شفاف

# bannerDesc3
source: Track your donations and see how your contributions make an impact
ar: تتبع تبرعاتك وشاهد كيف تساهم تبرعاتك في إحداث تأثير

# bannerTitle4
source: Secure Payments
ar: مدفوعات آمنة

# bannerDesc4
source: All transactions are processed securely through MTN Mobile Money
ar: جميع المعاملات تتم معالجتها بأمان عبر MTN Mobile Money

# authLogin
source: Sign In
ar: تسجيل الدخول

# authLoginTitle
source: Welcome Back
ar: مرحباً بعودتك

# authLoginSubtitle
source: Sign in to continue making a difference
ar: سجل الدخول للمتابعة في صنع الفرق

# authEmail
source: Email
ar: البريد الإلكتروني

# authEmailHint
source: Enter your email
ar: أدخل بريدك الإلكتروني

# authPassword
source: Password
ar: كلمة المرور

# authPasswordHint
source: Enter your password
ar: أدخل كلمة المرور

# authNoAccount
source: Don't have an account?
ar: ليس لديك حساب؟

# authSignUp
source: Sign Up
ar: إنشاء حساب

# authOr
source: OR
ar: أو

# authContinueGuest
source: Continue as Guest
ar: المتابعة كضيف

# authRegister
source: Create Account
ar: إنشاء حساب

# authRegisterTitle
source: Join GiveHope
ar: انضم إلى أعطِ أملاً

# authRegisterSubtitle
source: Create an account to start making donations
ar: أنشئ حساباً لبدء التبرع

# authName
source: Full Name (Optional)
ar: الاسم الكامل (اختياري)

# authNameHint
source: Enter your name
ar: أدخل اسمك

# authPhone
source: Phone Number (Optional)
ar: رقم الهاتف (اختياري)

# authPhoneHint
source: e.g., +237670000001
ar: مثال: +237670000001

# authConfirmPassword
source: Confirm Password
ar: تأكيد كلمة المرور

# authConfirmPasswordHint
source: Confirm your password
ar: أكد كلمة المرور

# authPasswordMismatch
source: Passwords do not match
ar: كلمات المرور غير متطابقة

# authPasswordMin
source: Password must be at least {length} characters
ar: يجب أن تكون كلمة المرور {length} أحرف على الأقل

# authAlreadyAccount
source: Already have an account?
ar: لديك حساب بالفعل؟

# authSignIn
source: Sign In
ar: تسجيل الدخول

# authMoMoInfo
source: Your phone number will be used for MTN MoMo payments
ar: سيتم استخدام رقم هاتفك لمدفوعات MTN MoMo

# authRequired
source: This field is required
ar: هذا الحقل مطلوب

# authInvalidEmail
source: Please enter a valid email address
ar: الرجاء إدخال بريد إلكتروني صحيح

# authInvalidPassword
source: Invalid email or password
ar: البريد الإلكتروني أو كلمة المرور غير صحيحة

# authUserExists
source: User with this email already exists
ar: يوجد مستخدم بهذا البريد الإلكتروني بالفعل

# authRegistrationFailed
source: Registration failed. Please try again.
ar: فشل التسجيل. الرجاء المحاولة مرة أخرى.

# authLoginFailed
source: Login failed. Please try again.
ar: فشل تسجيل الدخول. الرجاء المحاولة مرة أخرى.

# causeDetailTitle
source: Cause Details
ar: تفاصيل القضية

# causeRaised
source: Raised
ar: تم جمع

# causeGoal
source: Goal
ar: الهدف

# causeProgress
source: Progress
ar: التقدم

# causeDonors
source: Donors
ar: المتبرعون

# causeDonations
source: Donations
ar: التبرعات

# causeDaysLeft
source: days left
ar: يوم متبقي

# causeEnded
source: Campaign ended
ar: انتهت الحملة

# causeAbout
source: About this cause
ar: عن هذه القضية

# causeOrganizer
source: Organizer
ar: المنظم

# causeRecentDonations
source: Recent Donations
ar: التبرعات الأخيرة

# causeNoDonations
source: No donations yet
ar: لا توجد تبرعات بعد

# causeBeFirst
source: Be the first to donate!
ar: كن أول من يتبرع!

# causeShare
source: Share
ar: مشاركة

# causeReport
source: Report
ar: إبلاغ

# causeTotalReceived
source: Total Received
ar: إجمالي المستلم

# causeAvailable
source: Available
ar: المتاح

# causeBy
source: by
ar: بواسطة

# causeLoading
source: Loading cause details...
ar: جارٍ تحميل تفاصيل القضية...

source: Cause not found
ar: القضية غير موجودة

# causeNotFoundDesc
source: The cause you're looking for doesn't exist.
ar: القضية التي تبحث عنها غير موجودة.

# causeGoBack
source: Go Back
ar: رجوع

# causeManagePayouts
source: Manage Payouts
ar: إدارة المدفوعات

# causeCreateTitle
source: Create Cause
ar: إنشاء قضية

# causeCreateHeader
source: Start a Cause
ar: ابدأ قضية

# causeCreateSubtitle
source: Create a cause to receive donations
ar: أنشئ قضية لاستقبال التبرعات

# causeCreateName
source: Cause Name
ar: اسم القضية

# causeCreateNameHint
source: e.g., Help Build a School
ar: مثال: مساعدة بناء مدرسة

# causeCreateNameRequired
source: Cause name is required
ar: اسم القضية مطلوب

# causeCreateDescription
source: Description (Optional)
ar: الوصف (اختياري)

# causeCreateDescriptionHint
source: Describe your cause and how the funds will be used...
ar: اوصف قضيتك وكيف سيتم استخدام الأموال...

# causeCreateOwnerPhone
source: Owner Phone Number
ar: رقم هاتف المالك

# causeCreateOwnerPhoneHint
source: e.g., +237670000001
ar: مثال: +237670000001

# causeCreateMoMoWarning
source: This phone number will receive payouts via MTN MoMo. Make sure it's an active MTN Mobile Money account.
ar: سيتم استلام المدفوعات على هذا الرقم عبر MTN MoMo. تأكد أنه حساب MTN Mobile Money نشط.

# causeCreateSuccess
source: Cause created successfully!
ar: تم إنشاء القضية بنجاح!

# causeCreateFailed
source: Failed to create cause. Please try again.
ar: فشل إنشاء القضية. الرجاء المحاولة مرة أخرى.

# donateTitle
source: Make a Donation
ar: قدّم تبرعاً

# donateDonatingTo
source: Donating to
ar: التبرع لـ

# donateAmount
source: Donation Amount
ar: مبلغ التبرع

# donateAmountHint
source: Enter amount
ar: أدخل المبلغ

# donateAmountError
source: Please enter a valid amount
ar: الرجاء إدخال مبلغ صحيح

# donateAmountMin
source: Minimum donation is {amount}
ar: الحد الأدنى للتبرع هو {amount}

# donatePhone
source: MTN MoMo Phone Number
ar: رقم هاتف MTN MoMo

# donatePhoneHint
source: e.g., +237670000001
ar: مثال: +237670000001

# donatePhoneError
source: Please enter a valid phone number
ar: الرجاء إدخال رقم هاتف صحيح

# donateMoMoInfo
source: A payment request will be sent to this MTN MoMo number
ar: سيتم إرسال طلب دفع إلى رقم MTN MoMo هذا

# donateName
source: Your Name (Optional)
ar: اسمك (اختياري)

# donateNameHint
source: Enter your name
ar: أدخل اسمك

# donateMessage
source: Leave a Message (Optional)
ar: اترك رسالة (اختياري)

# donateMessageHint
source: Write a message of support...
ar: اكتب رسالة دعم...

# donateAnonymous
source: Donate anonymously
ar: تبرع بشكل مجهول

# donateQuickAmount
source: Quick amounts ({currency})
ar: مبالغ سريعة ({currency})

# donateCustomAmount
source: Custom amount
ar: مبلغ مخصص

# donateContinue
source: Donate via MTN MoMo
ar: تبرع عبر MTN MoMo

# donateProcessing
source: Processing...
ar: جارٍ المعالجة...

# donateWaiting
source: Waiting for Payment
ar: في انتظار الدفع

# donateWaitingDesc
source: A payment request has been sent to your phone. Please approve the MTN MoMo payment of {amount} {currency}.
ar: تم إرسال طلب دفع إلى هاتفك. الرجاء الموافقة على دفع MTN MoMo بمبلغ {amount} {currency}.

# donateSuccess
source: Thank You!
ar: شكراً لك!

# donateSuccessDesc
source: Your donation of {amount} {currency} to "{cause}" has been processed successfully.
ar: تم معالجة تبرعك بمبلغ {amount} {currency} لـ "{cause}" بنجاح.

# donateFailed
source: Donation Failed
ar: فشل التبرع

# donateFailedDesc
source: We couldn't process your donation. Please try again.
ar: لم نتمكن من معالجة تبرعك. الرجاء المحاولة مرة أخرى.

# donatePending
source: Payment Pending
ar: الدفع قيد الانتظار

# donatePendingDesc
source: The payment is still pending. Please check your phone and approve the MTN MoMo payment request. If you've already approved, it may take a moment to process.
ar: الدفع لا يزال قيد الانتظار. الرجاء التحقق من هاتفك والموافقة على طلب دفع MTN MoMo. إذا كنت قد وافقت بالفعل، قد يستغرق الأمر لحظة للمعالجة.

# donateRetry
source: Try Again
ar: حاول مجدداً

# donateDone
source: Done
ar: تم

# donateCancel
source: Cancel
ar: إلغاء

# historyTitle
source: Donation History
ar: سجل التبرعات

# historySubtitle
source: View your past donations
ar: عرض تبرعاتك السابقة

# historyEnterPhone
source: Enter your phone number to view your donation history
ar: أدخل رقم هاتفك لعرض سجل تبرعاتك

# historyPhoneHint
source: e.g., +237670000001
ar: مثال: +237670000001

# historySearch
source: Search
ar: بحث

# historyViewHistory
source: View History
ar: عرض السجل

# historyNoResults
source: No donations found
ar: لا توجد تبرعات

# historyNoResultsDesc
source: You haven't made any donations yet. Start giving today!
ar: لم تقم بأي تبرعات بعد. ابدأ بالعطاء اليوم!

# historyTotal
source: Total Donated
ar: إجمالي التبرعات

# historyCount
source: {count} donations
ar: {count} تبرعات

# historyStatusPending
source: Pending
ar: قيد الانتظار

# historyStatusSuccess
source: Success
ar: نجح

# historyStatusFailed
source: Failed
ar: فشل

# historyLoading
source: Loading history...
ar: جارٍ تحميل السجل...

# historyGetStarted
source: View your donation history
ar: عرض سجل تبرعاتك

# historyGetStartedDesc
source: Enter your phone number above to get started
ar: أدخل رقم هاتفك أعلاه للبدء

# payoutTitle
source: Payout Management
ar: إدارة المدفوعات

# payoutSubtitle
source: Manage your cause's funds
ar: إدارة أموال قضيتك

# payoutAvailable
source: Available for Payout
ar: متاح للسحب

# payoutTotal
source: Total Received
ar: إجمالي المستلم

# payoutRequest
source: Request Payout
ar: طلب سحب

source: Payout Amount
ar: مبلغ السحب

# payoutAmountHint
source: Enter amount to withdraw
ar: أدخل المبلغ للسحب

# payoutAmountError
source: Please enter a valid amount
ar: الرجاء إدخال مبلغ صحيح

# payoutAmountMax
source: Maximum available: {amount}
ar: الحد الأقصى المتاح: {amount}

# payoutNotes
source: Notes (Optional)
ar: ملاحظات (اختياري)

# payoutNotesHint
source: Add any notes...
ar: أضف أي ملاحظات...

# payoutSubmit
source: Submit Request
ar: تقديم الطلب

# payoutProcessing
source: Processing...
ar: جارٍ المعالجة...

# payoutSuccess
source: Payout Requested
ar: تم طلب السحب

# payoutSuccessDesc
source: Payout request submitted successfully!
ar: تم تقديم طلب السحب بنجاح!

source: Payout Failed
ar: فشل السحب

# payoutFailedDesc
source: We couldn't process your payout request. Please try again.
ar: لم نتمكن من معالجة طلب السحب. الرجاء المحاولة مرة أخرى.

source: Payout History
ar: سجل المدفوعات

# payoutNoHistory
source: No payouts yet
ar: لا توجد مدفوعات بعد

# payoutNoFunds
source: No funds available for payout. Receive some donations first!
ar: لا توجد أموال متاحة للسحب. استقبل بعض التبرعات أولاً!

# payoutMoMoInfo
source: Funds will be sent to the MTN MoMo account: {phone}
ar: سيتم إرسال الأموال إلى حساب MTN MoMo: {phone}

# payoutStatusPending
source: Pending
ar: قيد الانتظار

# payoutStatusProcessing
source: Processing
ar: قيد المعالجة

# payoutStatusCompleted
source: Completed
ar: مكتمل

# payoutStatusFailed
source: Failed
ar: فشل

# payoutStatusCancelled
source: Cancelled
ar: ملغى

# payoutLoading
source: Loading...
ar: جارٍ التحميل...

# settingsTitle
source: Settings
ar: الإعدادات

# settingsAppearance
source: Appearance
ar: المظهر

# settingsTheme
source: Theme
ar: السمة

# settingsThemeLight
source: Light
ar: فاتح

# settingsThemeDark
source: Dark
ar: داكن

# settingsThemeSystem
source: System
ar: النظام

# settingsLanguage
source: Language
ar: اللغة

# settingsProfile
source: Profile
ar: الملف الشخصي

# settingsEditProfile
source: Edit Profile
ar: تعديل الملف الشخصي

# settingsNotifications
source: Notifications
ar: الإشعارات

# settingsAbout
source: About
ar: حول

# settingsPrivacy
source: Privacy Policy
ar: سياسة الخصوصية

# settingsTerms
source: Terms of Service
ar: شروط الخدمة

# settingsVersion
source: Version {version}
ar: الإصدار {version}

# settingsContact
source: Contact Us
ar: تواصل معنا

# settingsRate
source: Rate App
ar: قيّم التطبيق

# settingsChooseTheme
source: Choose Theme
ar: اختر السمة

# settingsChooseLanguage
source: Choose Language
ar: اختر اللغة

# settingsAboutTitle
source: About GiveHope
ar: حول أعطِ أملاً

# settingsAboutDesc
source: GiveHope is a donation and micro-payments app designed to make charitable giving easy and accessible.
ar: أعطِ أملاً هو تطبيق تبرعات ومدفوعات صغيرة مصمم لجعل العطاء الخيري سهلاً ومتاحاً.

# settingsAboutMission
source: Our mission is to connect generous donors with causes that matter, empowering communities one donation at a time.
ar: مهمتنا هي ربط المتبرعين الكرماء بالقضايا المهمة، وتمكين المجتمعات تبرعاً تلو الآخر.

# settingsHelp
source: Help & FAQ
ar: المساعدة والأسئلة الشائعة

# settingsLogout
source: Logout
ar: تسجيل الخروج

# settingsLogoutConfirm
source: Are you sure you want to logout?
ar: هل أنت متأكد من تسجيل الخروج؟

# settingsLogoutConfirmDesc
source: You will need to login again to access your account.
ar: ستحتاج إلى تسجيل الدخول مرة أخرى للوصول إلى حسابك.

# commonLoading
source: Loading...
ar: جارٍ التحميل...

# commonError
source: Something went wrong
ar: حدث خطأ ما

# commonRetry
source: Retry
ar: إعادة المحاولة

# commonCancel
source: Cancel
ar: إلغاء

# commonConfirm
source: Confirm
ar: تأكيد

# commonSave
source: Save
ar: حفظ

# commonClose
source: Close
ar: إغلاق

# commonBack
source: Back
ar: رجوع

# commonNext
source: Next
ar: التالي

# commonDone
source: Done
ar: تم

# commonOk
source: OK
ar: حسناً

# commonYes
source: Yes
ar: نعم

# commonNo
source: No
ar: لا

# commonSearch
source: Search
ar: بحث

# commonSeeAll
source: See All
ar: عرض الكل

# commonNoInternet
source: No Internet Connection
ar: لا يوجد اتصال بالإنترنت

# commonNoInternetDesc
source: It looks like you're offline. Please check your internet connection and try again.
ar: يبدو أنك غير متصل بالإنترنت. الرجاء التحقق من اتصالك بالإنترنت والمحاولة مرة أخرى.

# noInternetTip1
source: Check your Wi-Fi or mobile data
ar: تحقق من Wi-Fi أو بيانات الجوال

# noInternetTip2
source: Make sure airplane mode is turned off
ar: تأكد من إيقاف وضع الطيران

# noInternetTip3
source: Try moving to an area with better signal
ar: حاول الانتقال إلى منطقة بإشارة أفضل

# commonServerError
source: Server error
ar: خطأ في الخادم

# commonServerErrorDesc
source: Something went wrong on our end. Please try again later.
ar: حدث خطأ من جانبنا. الرجاء المحاولة لاحقاً.

# commonUnknownError
source: Unknown error
ar: خطأ غير معروف

# commonUnknownErrorDesc
source: An unexpected error occurred. Please try again.
ar: حدث خطأ غير متوقع. الرجاء المحاولة مرة أخرى.

# commonCreated
source: Created
ar: تم الإنشاء

# commonRaised
source: raised
ar: تم جمع

# commonDonations
source: donations
ar: تبرعات

# commonWelcome
source: Welcome
ar: مرحباً

# dateFormat
source: MMM d, yyyy
ar: d MMM yyyy

# privacyTitle
source: Privacy Policy
ar: سياسة الخصوصية

# privacyLastUpdated
source: Last updated: January 2024
ar: آخر تحديث: يناير 2024

# privacyIntroduction
source: Introduction
ar: مقدمة

# privacyIntroductionDesc
source: At GiveHope, we are committed to protecting your privacy and personal information. This Privacy Policy explains how we collect, use, and safeguard your data when you use our donation and micro-payments mobile application.
ar: في أعطِ أملاً، نحن ملتزمون بحماية خصوصيتك ومعلوماتك الشخصية. توضح سياسة الخصوصية هذه كيفية جمع واستخدام وحماية بياناتك عند استخدام تطبيق التبرعات والمدفوعات الصغيرة الخاص بنا.

# privacyInformationWeCollect
source: Information We Collect
ar: المعلومات التي نجمعها

# privacyInformationWeCollectDesc
source: We collect information that you provide directly to us, including your name, email address, phone number, and payment information when you create an account, make donations, or create causes. We also collect usage data and device information to improve our services.
ar: نجمع المعلومات التي تقدمها لنا مباشرة، بما في ذلك اسمك وعنوان بريدك الإلكتروني ورقم هاتفك ومعلومات الدفع عند إنشاء حساب أو إجراء تبرعات أو إنشاء قضايا. كما نجمع بيانات الاستخدام ومعلومات الجهاز لتحسين خدماتنا.

# privacyHowWeUse
source: How We Use Your Information
ar: كيف نستخدم معلوماتك

# privacyHowWeUseDesc
source: We use your information to process donations, manage your account, communicate with you about your transactions, improve our services, and comply with legal obligations. We do not sell your personal information to third parties.
ar: نستخدم معلوماتك لمعالجة التبرعات وإدارة حسابك والتواصل معك حول معاملاتك وتحسين خدماتنا والامتثال للالتزامات القانونية. لا نبيع معلوماتك الشخصية لأطراف ثالثة.

# privacyDataSecurity
source: Data Security
ar: أمان البيانات

# privacyDataSecurityDesc
source: We implement industry-standard security measures to protect your personal information, including encryption, secure authentication, and regular security audits. However, no method of transmission over the internet is 100% secure.
ar: نطبق تدابير أمنية معيارية في الصناعة لحماية معلوماتك الشخصية، بما في ذلك التشفير والمصادقة الآمنة والتدقيق الأمني المنتظم. ومع ذلك، لا توجد طريقة نقل عبر الإنترنت آمنة بنسبة 100٪.

# privacyThirdParty
source: Third-Party Services
ar: خدمات الطرف الثالث

# privacyThirdPartyDesc
source: We use MTN Mobile Money (MoMo) for payment processing. When you make a donation, your payment information is processed securely through MTN's payment gateway. Please review MTN's privacy policy for information about how they handle your data.
ar: نستخدم MTN Mobile Money (MoMo) لمعالجة المدفوعات. عند إجراء تبرع، تتم معالجة معلومات الدفع الخاصة بك بأمان من خلال بوابة الدفع الخاصة بـ MTN. يرجى مراجعة سياسة الخصوصية الخاصة بـ MTN للحصول على معلومات حول كيفية تعاملهم مع بياناتك.

# privacyYourRights
source: Your Rights
ar: حقوقك

# privacyYourRightsDesc
source: You have the right to access, update, or delete your personal information at any time. You can also opt-out of certain communications. To exercise these rights, please contact us using the information provided below.
ar: لديك الحق في الوصول إلى معلوماتك الشخصية أو تحديثها أو حذفها في أي وقت. يمكنك أيضاً إلغاء الاشتراك في بعض الاتصالات. لممارسة هذه الحقوق، يرجى الاتصال بنا باستخدام المعلومات المقدمة أدناه.

# privacyChildren
source: Children's Privacy
ar: خصوصية الأطفال

# privacyChildrenDesc
source: Our services are not intended for children under the age of 18. We do not knowingly collect personal information from children. If you believe we have collected information from a child, please contact us immediately.
ar: خدماتنا غير مخصصة للأطفال دون سن 18 عاماً. لا نجمع معلومات شخصية من الأطفال عن علم. إذا كنت تعتقد أننا جمعنا معلومات من طفل، يرجى الاتصال بنا على الفور.

# privacyChanges
source: Changes to Privacy Policy
ar: تغييرات سياسة الخصوصية

# privacyChangesDesc
source: We may update this Privacy Policy from time to time. We will notify you of any changes by posting the new Privacy Policy on this page and updating the "Last updated" date. You are advised to review this Privacy Policy periodically.
ar: قد نحدث سياسة الخصوصية هذه من وقت لآخر. سنخطرك بأي تغييرات عن طريق نشر سياسة الخصوصية الجديدة على هذه الصفحة وتحديث تاريخ "آخر تحديث". يُنصح بمراجعة سياسة الخصوصية هذه بشكل دوري.

# privacyContact
source: Contact Us
ar: تواصل معنا

# privacyContactDesc
source: If you have any questions about this Privacy Policy, please contact us:
ar: إذا كان لديك أي أسئلة حول سياسة الخصوصية هذه، يرجى الاتصال بنا:

# privacyContactUs
source: Contact Us
ar: تواصل معنا

# termsTitle
source: Terms of Service
ar: شروط الخدمة

# termsLastUpdated
source: Last updated: January 2024
ar: آخر تحديث: يناير 2024

# termsIntroduction
source: Introduction
ar: مقدمة

# termsIntroductionDesc
source: Welcome to GiveHope. These Terms of Service govern your use of our donation and micro-payments mobile application. By using our app, you agree to be bound by these terms. Please read them carefully.
ar: مرحباً بك في أعطِ أملاً. تحكم شروط الخدمة هذه استخدامك لتطبيق التبرعات والمدفوعات الصغيرة الخاص بنا. باستخدام تطبيقنا، فإنك توافق على الالتزام بهذه الشروط. يرجى قراءتها بعناية.

# termsAcceptance
source: Acceptance of Terms
ar: قبول الشروط

# termsAcceptanceDesc
source: By accessing or using GiveHope, you agree to comply with and be bound by these Terms of Service. If you do not agree with any part of these terms, you may not use our services.
ar: من خلال الوصول إلى أعطِ أملاً أو استخدامه، فإنك توافق على الامتثال والالتزام بشروط الخدمة هذه. إذا كنت لا توافق على أي جزء من هذه الشروط، فلا يجوز لك استخدام خدماتنا.

# termsUseOfService
source: Use of Service
ar: استخدام الخدمة

# termsUseOfServiceDesc
source: You may use GiveHope to browse causes, make donations, and create causes. You agree to use the service only for lawful purposes and in accordance with these terms. You are responsible for maintaining the confidentiality of your account credentials.
ar: يمكنك استخدام أعطِ أملاً لتصفح القضايا وإجراء التبرعات وإنشاء القضايا. توافق على استخدام الخدمة فقط للأغراض القانونية ووفقاً لهذه الشروط. أنت مسؤول عن الحفاظ على سرية بيانات اعتماد حسابك.

# termsUserAccounts
source: User Accounts
ar: حسابات المستخدمين

# termsUserAccountsDesc
source: To use certain features, you must create an account. You are responsible for providing accurate information and maintaining the security of your account. You must notify us immediately of any unauthorized use of your account.
ar: لاستخدام ميزات معينة، يجب عليك إنشاء حساب. أنت مسؤول عن تقديم معلومات دقيقة والحفاظ على أمان حسابك. يجب عليك إخطارنا فوراً بأي استخدام غير مصرح به لحسابك.

# termsDonations
source: Donations and Payments
ar: التبرعات والمدفوعات

# termsDonationsDesc
source: All donations are processed through MTN Mobile Money (MoMo). Donations are final and non-refundable unless required by law. We are not responsible for the actions of cause creators or the use of donated funds. Please verify cause information before donating.
ar: يتم معالجة جميع التبرعات من خلال MTN Mobile Money (MoMo). التبرعات نهائية وغير قابلة للاسترداد ما لم يقتض القانون ذلك. نحن لسنا مسؤولين عن أفعال منشئي القضايا أو استخدام الأموال المتبرع بها. يرجى التحقق من معلومات القضية قبل التبرع.

# termsProhibited
source: Prohibited Activities
ar: الأنشطة المحظورة

# termsProhibitedDesc
source: You agree not to use GiveHope for any illegal activities, fraud, money laundering, or to create false causes. You may not interfere with the operation of the service or attempt to gain unauthorized access to our systems.
ar: توافق على عدم استخدام أعطِ أملاً لأي أنشطة غير قانونية أو احتيال أو غسيل أموال أو لإنشاء قضايا كاذبة. لا يجوز لك التدخل في تشغيل الخدمة أو محاولة الحصول على وصول غير مصرح به لأنظمتنا.

# termsIntellectual
source: Intellectual Property
ar: الملكية الفكرية
