Repository: Fadwahigga/GiveHope
Catalog: lib/src/l10n/app_*.arb
Languages: ar

# termsIntellectualDesc
source: All content, features, and functionality of GiveHope are owned by us and are protected by copyright, trademark, and other intellectual property laws. You may not reproduce, distribute, or create derivative works without our permission.
ar: جميع المحتويات والميزات والوظائف الخاصة بأعطِ أملاً مملوكة لنا ومحمية بموجب قوانين حقوق النشر والعلامات التجارية وقوانين الملكية الفكرية الأخرى. لا يجوز لك نسخ أو توزيع أو إنشاء أعمال مشتقة دون إذننا.

# termsLiability
source: Limitation of Liability
ar: تحديد المسؤولية

# termsLiabilityDesc
source: GiveHope is provided "as is" without warranties of any kind. We are not liable for any damages arising from your use of the service, including but not limited to donation disputes, payment processing issues, or cause-related matters.
ar: يتم توفير أعطِ أملاً "كما هو" دون ضمانات من أي نوع. نحن لسنا مسؤولين عن أي أضرار ناتجة عن استخدامك للخدمة، بما في ذلك على سبيل المثال لا الحصر نزاعات التبرعات أو مشاكل معالجة المدفوعات أو الأمور المتعلقة بالقضايا.

# termsTermination
source: Termination
ar: إنهاء الخدمة

# termsTerminationDesc
source: We reserve the right to suspend or terminate your account at any time for violation of these terms or for any other reason we deem necessary. You may also terminate your account at any time by contacting us.
ar: نحتفظ بالحق في تعليق أو إنهاء حسابك في أي وقت لانتهاك هذه الشروط أو لأي سبب آخر نراه ضرورياً. يمكنك أيضاً إنهاء حسابك في أي وقت عن طريق الاتصال بنا.

# termsChanges
source: Changes to Terms
ar: تغييرات الشروط

# termsChangesDesc
source: We may modify these Terms of Service at any time. We will notify you of significant changes by posting the updated terms in the app. Your continued use of the service after changes constitutes acceptance of the new terms.
ar: قد نعدل شروط الخدمة هذه في أي وقت. سنخطرك بالتغييرات المهمة عن طريق نشر الشروط المحدثة في التطبيق. استمرارك في استخدام الخدمة بعد التغييرات يشكل قبولاً للشروط الجديدة.

# termsContact
source: Contact Us
ar: تواصل معنا

# termsContactDesc
source: If you have any questions about these Terms of Service, please contact us:
ar: إذا كان لديك أي أسئلة حول شروط الخدمة هذه، يرجى الاتصال بنا:

# termsContactUs
source: Contact Us
ar: تواصل معنا

# faqTitle
source: Frequently Asked Questions
ar: الأسئلة الشائعة

# faqSubtitle
source: Find answers to common questions
ar: ابحث عن إجابات للأسئلة الشائعة

# faqQuestion1
source: How do I make a donation?
ar: كيف أقوم بالتبرع؟

# faqAnswer1
source: To make a donation, browse the causes on the home screen, select a cause you'd like to support, and tap the "Donate" button. Enter the amount and your MTN MoMo phone number. A payment request will be sent to your phone for approval.
ar: لإجراء تبرع، تصفح القضايا على الشاشة الرئيسية، واختر قضية ترغب في دعمها، واضغط على زر "تبرع". أدخل المبلغ ورقم هاتف MTN MoMo الخاص بك. سيتم إرسال طلب دفع إلى هاتفك للموافقة.

# faqQuestion2
source: Is my payment secure?
ar: هل دفعي آمن؟

# faqAnswer2
source: Yes, all payments are processed securely through MTN Mobile Money (MoMo), a trusted payment gateway. We do not store your payment credentials, and all transactions are encrypted.
ar: نعم، يتم معالجة جميع المدفوعات بأمان من خلال MTN Mobile Money (MoMo)، وهي بوابة دفع موثوقة. لا نخزن بيانات اعتماد الدفع الخاصة بك، وجميع المعاملات مشفرة.

# faqQuestion3
source: Can I get a refund?
ar: هل يمكنني الحصول على استرداد؟

# faqAnswer3
source: Donations are generally final and non-refundable. However, if you believe there has been an error or fraud, please contact us immediately at fadwa.ali20@gmail.com with details of your transaction.
ar: التبرعات نهائية بشكل عام وغير قابلة للاسترداد. ومع ذلك، إذا كنت تعتقد أن هناك خطأ أو احتيال، يرجى الاتصال بنا على الفور على fadwa.ali20@gmail.com مع تفاصيل معاملتك.

# faqQuestion4
source: How do I create a cause?
ar: كيف أنشئ قضية؟

# faqAnswer4
source: To create a cause, you need to be logged in. Tap the "Create Cause" button, fill in the cause details including name, description, and your MTN MoMo phone number (where you'll receive payouts). Submit the form to create your cause.
ar: لإنشاء قضية، يجب أن تكون مسجلاً الدخول. اضغط على زر "إنشاء قضية"، واملأ تفاصيل القضية بما في ذلك الاسم والوصف ورقم هاتف MTN MoMo الخاص بك (حيث ستستلم المدفوعات). أرسل النموذج لإنشاء قضيتك.

# faqQuestion5
source: How do I receive payouts?
ar: كيف أستلم المدفوعات؟

# faqAnswer5
source: As a cause owner, you can request payouts from the Payout Management screen. Enter the amount you want to withdraw, and the funds will be transferred to your registered MTN MoMo account. Payouts may take a few minutes to process.
ar: كمالك قضية، يمكنك طلب المدفوعات من شاشة إدارة المدفوعات. أدخل المبلغ الذي تريد سحبه، وسيتم تحويل الأموال إلى حساب MTN MoMo المسجل لديك. قد تستغرق المدفوعات بضع دقائق للمعالجة.

# faqQuestion6
source: What if my payment is pending?
ar: ماذا لو كان دفعي قيد الانتظار؟

# faqAnswer6
source: If your payment is pending, check your phone for the MTN MoMo payment request and approve it. If you've already approved but it's still pending, wait a few moments as processing can take time. You can also check the donation status in the app.
ar: إذا كان دفعتك قيد الانتظار، تحقق من هاتفك لطلب دفع MTN MoMo ووافق عليه. إذا كنت قد وافقت بالفعل لكنه لا يزال قيد الانتظار، انتظر لحظات حيث قد تستغرق المعالجة وقتاً. يمكنك أيضاً التحقق من حالة التبرع في التطبيق.

# faqQuestion7
source: How do I view my donation history?
ar: كيف أعرض سجل تبرعاتي؟

# faqAnswer7
source: Go to the History tab and enter your phone number. You'll see all your past donations, including the amount, cause, date, and status of each donation.
ar: انتقل إلى علامة تبويب السجل وأدخل رقم هاتفك. سترى جميع تبرعاتك السابقة، بما في ذلك المبلغ والقضية والتاريخ وحالة كل تبرع.

# faqQuestion8
source: Is my personal information safe?
ar: هل معلوماتي الشخصية آمنة؟

# faqAnswer8
source: Yes, we take your privacy seriously. We use industry-standard security measures to protect your data. We do not sell your personal information to third parties. For more details, please read our Privacy Policy.
ar: نعم، نحن نأخذ خصوصيتك على محمل الجد. نستخدم تدابير أمنية معيارية في الصناعة لحماية بياناتك. لا نبيع معلوماتك الشخصية لأطراف ثالثة. لمزيد من التفاصيل، يرجى قراءة سياسة الخصوصية الخاصة بنا.

# faqStillHaveQuestions
source: Still have questions?
ar: لا تزال لديك أسئلة؟

# faqContactUs
source: Feel free to reach out to us via email or use the contact form above.
ar: لا تتردد في التواصل معنا عبر البريد الإلكتروني أو استخدم نموذج الاتصال أعلاه.

# contactTitle
source: Contact Us
ar: تواصل معنا

# contactSubtitle
source: We're here to help. Get in touch with us!
ar: نحن هنا للمساعدة. تواصل معنا!

# contactEmailLabel
source: Email Address
ar: عنوان البريد الإلكتروني

# contactCopyEmail
source: Copy email address
ar: نسخ عنوان البريد الإلكتروني

# contactEmailCopied
source: Email address copied to clipboard
ar: تم نسخ عنوان البريد الإلكتروني إلى الحافظة

# contactOpenEmail
source: Open Email App
ar: فتح تطبيق البريد

# contactFormTitle
source: Send us a Message
ar: أرسل لنا رسالة

# contactFormName
source: Your Name
ar: اسمك

# contactFormNameHint
source: Enter your full name
ar: أدخل اسمك الكامل

# contactFormNameRequired
source: Name is required
ar: الاسم مطلوب

# contactFormEmail
source: Your Email
ar: بريدك الإلكتروني

# contactFormEmailHint
source: Enter your email address
ar: أدخل عنوان بريدك الإلكتروني

# contactFormEmailRequired
source: Email is required
ar: البريد الإلكتروني مطلوب

# contactFormEmailInvalid
source: Please enter a valid email address
ar: الرجاء إدخال عنوان بريد إلكتروني صحيح

# contactFormSubject
source: Subject
ar: الموضوع

# contactFormSubjectHint
source: What is this regarding?
ar: بم يتعلق هذا؟

# contactFormSubjectRequired
source: Subject is required
ar: الموضوع مطلوب

# contactFormMessage
source: Message
ar: الرسالة

# contactFormMessageHint
source: Tell us how we can help...
ar: أخبرنا كيف يمكننا المساعدة...

# contactFormMessageRequired
source: Message is required
ar: الرسالة مطلوب

# contactFormMessageMinLength
source: Message must be at least 10 characters
ar: يجب أن تكون الرسالة 10 أحرف على الأقل

# contactFormSubmit
source: Send Message
ar: إرسال الرسالة

# contactFormSuccess
source: Email app opened successfully! Please send your message.
ar: تم فتح تطبيق البريد بنجاح! يرجى إرسال رسالتك.

# contactFormError
source: Could not open email app. Please try again or email us directly at fadwa.ali20@gmail.com
ar: تعذر فتح تطبيق البريد. يرجى المحاولة مرة أخرى أو مراسلتنا مباشرة على fadwa.ali20@gmail.com

# contactStillHaveQuestions
source: Still have questions?
ar: لا تزال لديك أسئلة؟

# contactContactUs
source: Feel free to reach out to us via email or use the contact form above.
ar: لا تتردد في التواصل معنا عبر البريد الإلكتروني أو استخدم نموذج الاتصال أعلاه.
